import Link from 'next/link';

const Godan = () => {
  return (
    <section className="min-h-screen bg-amber-50 text-olive-800 px-6 py-12 md:px-16 md:py-20">
      <div className="max-w-4xl mx-auto">
        <div className="flex justify-between items-center mb-8">
          <h1 className="text-4xl md:text-6xl font-serif font-bold border-b-4 border-black">
            गोदान
          </h1>
          <Link
            href="/books"
            className="px-10 text-xl py-4 bg-black text-amber-50 font-bold border-2 border-black mb-4"
          >
            पीछे जाएं
          </Link>
        </div>
        <article className="text-lg md:text-xl font-serif leading-relaxed space-y-6">
          <p>
            <strong>गोदान</strong>, मुंशी प्रेमचंद का सबसे प्रसिद्ध उपन्यास है, जो 1936 में प्रकाशित हुआ। यह उपन्यास भारतीय
            ग्रामीण जीवन के सामाजिक, आर्थिक और राजनीतिक संघर्षों का वास्तविक चित्रण है। इसकी कथा एक किसान होरी और उसके
            परिवार के जीवन के इर्द-गिर्द घूमती है।
          </p>
          <p>
            होरी, एक गरीब किसान, अपने जीवन में सच्चाई और कर्तव्यपालन का प्रतीक है। उसकी सबसे बड़ी इच्छा है कि वह अपनी
            ज़िंदगी में एक गाय खरीद सके, क्योंकि गाय भारतीय संस्कृति में धन और संपन्नता का प्रतीक मानी जाती है। हालांकि, इस
            लक्ष्य को पाने के लिए उसे कई कठिनाइयों का सामना करना पड़ता है। 
          </p>
          <p>
            कहानी की शुरुआत में होरी को एक गाय मिल जाती है, लेकिन उसकी खुशी अल्पकालिक रहती है क्योंकि उसके भाई हीरा और
            मोटा उसे ज़हर देकर मार देते हैं। इस घटना के बाद होरी का जीवन समस्याओं से भर जाता है। उसे सामाजिक अपमान, गरीबी और
            अन्याय का सामना करना पड़ता है। 
          </p>
          <p>
            होरी का परिवार भी इन संघर्षों में शामिल है। उसकी पत्नी धनिया एक मजबूत और निडर महिला है जो अपने परिवार के
            कल्याण के लिए किसी भी कठिनाई से नहीं डरती। उनका बेटा गोबर, पिता की सोच से अलग, शहर की ओर आकर्षित होता है।
            गोबर शहर की जिंदगी में अपने लिए नए अवसर खोजने की कोशिश करता है। 
          </p>
          <p>
            कहानी में प्रेमचंद ने ग्रामीण भारत की सामूहिकता, जातिगत भेदभाव, भ्रष्टाचार, धार्मिक पाखंड और आर्थिक शोषण को
            दर्शाया है। उपन्यास में यह दिखाया गया है कि कैसे एक गरीब किसान और उसका परिवार सामाजिक व्यवस्था के दबाव में अपनी
            इच्छाओं और सपनों का बलिदान करते हैं।
          </p>
          <p>
            अंत में, होरी अपनी पूरी संपत्ति गंवा देता है और अपनी अंतिम सांस के साथ एक गाय दान करने की इच्छा प्रकट करता है।
            गोदान, भारतीय समाज की विडंबनाओं का प्रतीक है। यह उपन्यास मानवता, सहिष्णुता और त्याग की भावना को प्रकट करता है।
          </p>
          <p>
            गोदान ने भारतीय साहित्य को एक नई दिशा दी है। यह न केवल प्रेमचंद के साहित्यिक योगदान का शिखर है, बल्कि यह भारतीय
            ग्रामीण जीवन की सच्ची तस्वीर प्रस्तुत करता है। यह उपन्यास आज भी पाठकों के दिलों में अपनी गहरी छाप छोड़ता है।
          </p>
        </article>
      </div>
    </section>
  );
};

export default Godan;