import Link from 'next/link';

const Kafan = () => {
  return (
    <section className="min-h-screen bg-amber-50 text-olive-800 px-6 py-12 md:px-16 md:py-20">
      <div className="max-w-4xl mx-auto">
        <div className="flex justify-between items-center mb-8">
          <h1 className="text-4xl md:text-6xl font-serif font-bold border-b-4 border-black">
            कफ़न
          </h1>
          <Link
            href="/books"
            className="px-10 text-xl py-4 bg-black text-amber-50 font-bold border-2 border-black mb-4"
          >
            पीछे जाएं
          </Link>
        </div>
        <article className="text-lg md:text-xl font-serif leading-relaxed space-y-6">
          <p>
            <strong>कफ़न</strong>, मुंशी प्रेमचंद की सबसे विवादास्पद और गहरी कहानियों में से एक है। यह कहानी सामाजिक
            और आर्थिक विषमता, मानवीय संवेदनहीनता और शोषण पर करारा व्यंग्य है। कहानी एक गरीब और बेरोजगार पिता- बेटे
            की जोड़ी, घीसू और माधव के इर्द-गिर्द घूमती है। 
          </p>
          <p>
            कहानी की शुरुआत में, माधव की पत्नी का प्रसव के दौरान जीवन और मृत्यु के बीच संघर्ष हो रहा है। लेकिन
            घीसू और माधव उसकी देखभाल करने की बजाय बाहर अलाव के पास बैठकर आलू सेंकते और खाते हैं। इस घटना से उनकी
            असंवेदनशीलता और लापरवाही स्पष्ट होती है। 
          </p>
          <p>
            उनकी गरीबी और आलस्य का यह आलम है कि गांव वाले भी उनकी मदद नहीं करना चाहते। अंततः माधव की पत्नी की
            मृत्यु हो जाती है। दोनों पिता-पुत्र मिलकर गांव वालों से कफ़न के लिए पैसे इकट्ठा करते हैं। 
          </p>
          <p>
            लेकिन, इसके बाद एक असंवेदनशील मोड़ आता है। घीसू और माधव कफ़न खरीदने की बजाय उस पैसे से शराब और खाना
            खाते हैं। वे अपनी लापरवाहियों और स्वार्थपूर्ण दृष्टिकोण को यह कहकर तर्कसंगत ठहराते हैं कि मृतक को
            कफ़न की आवश्यकता नहीं है, जबकि वे जिंदा हैं और उन्हें इसकी जरूरत है।
          </p>
          <p>
            प्रेमचंद ने इस कहानी में गरीबी, शोषण और समाज की विडंबनाओं का गहरा चित्रण किया है। "कफ़न" उन लोगों की
            कहानी है जो गरीबी और भूख से इतने टूट चुके हैं कि उनके लिए नैतिकता और सामाजिक जिम्मेदारी का कोई महत्व
            नहीं रह जाता।
          </p>
          <p>
            यह कहानी पाठकों को झकझोर देती है और समाज की उस कठोर सच्चाई से परिचित कराती है, जहां आर्थिक असमानता
            और मानवीय संवेदनहीनता प्रमुख हैं। प्रेमचंद ने "कफ़न" के माध्यम से सामाजिक व्यवस्था पर गहरी चोट की है,
            जो आज भी प्रासंगिक है।
          </p>
        </article>
      </div>
    </section>
  );
};

export default Kafan;